#Область ПрограммныйИнтерфейс

// Производит выичсление суммы в ТЧ на форме
//
// Параметры:
// Форма - ФормаКлиентскогоПриложения
// ИмяТЧ - Строка
//
Процедура ПриИзмененииПересчитываемыхПоказателей(Форма, ИмяТЧ) Экспорт

	Элементы = Форма.Элементы;
	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	//@skip-check bsl-legacy-check-string-literal
	Если ТекущиеДанные["Количество"] = 0 Тогда
		ТекущиеДанные["Количество"] = 1;
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	ТекущиеДанные["Сумма"] = ТекущиеДанные["Количество"] * ТекущиеДанные["Цена"];
	
КонецПроцедуры

#КонецОбласти
