#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = Движения.Управленческий;
	
	Если Не НаборЗаписей.Модифицированность() И Не ЭтоНовый() Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Если НаборЗаписей.Количество() Тогда
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Период = Дата;	
		КонецЦикла;
		НаборЗаписей.УстановитьАктивность(Не ПометкаУдаления);
	КонецЕсли;
	
	НаборЗаписей.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
