#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	УстановитьПараметрСеанса(ПараметрКоманды);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("%1 установлен текущим.", ПараметрКоманды);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает параметр сеанса ТекущийСотрудник
//
// Параметры:
// ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//
&НаСервере
Процедура УстановитьПараметрСеанса(ФизическоеЛицо)

	ПараметрыСеанса.ТекущийСотрудник = ФизическоеЛицо; 
		
КонецПроцедуры

#КонецОбласти
