#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПериодФормирования.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	ПериодФормирования.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	Объект.График = Справочники.Графики.Пятидневка;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьГрафик(Объект.График,
									Новый Структура("Начало, Конец",
													 ПериодФормирования.ДатаНачала,
													 ПериодФормирования.ДатаОкончания));
КонецПроцедуры

#КонецОбласти

