#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет графики в зависимости от выбранных параметров
//
// Параметры:
// График - СправочникСсылка.Графики
// ПериодДействия - Структура
//
Процедура ЗаполнитьГрафик(График, ПериодДействия) Экспорт
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.График.Установить(График);
	
	ЧислоСекундВСутках = 86400;
	
	НачалоПериода = ПериодДействия.Начало;
	КонецПериода = ПериодДействия.Конец;
	
	Пока НачалоПериода < КонецПериода Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.График = График;
		Запись.Дата = НачалоПериода;
		Если График = Справочники.Графики.Пятидневка Тогда
		
			Если ДеньНедели(НачалоПериода) = 6 Или ДеньНедели(НачалоПериода) = 7 Тогда
				Запись.КоличествоДней = 0;	
			Иначе
				Запись.КоличествоДней = 1;
			КонецЕсли;
			
		ИначеЕсли График = Справочники.Графики.Шестидневка Тогда
			
			Если ДеньНедели(НачалоПериода) = 7 Тогда
				Запись.КоличествоДней = 0;	
			Иначе
				Запись.КоличествоДней = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		НачалоПериода = НачалоПериода + ЧислоСекундВСутках;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
