#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКартуМаршрута();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Задача выполнена" и Параметр = Объект.Ссылка Тогда
		Прочитать();
		ОбновитьКартуМаршрута();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьКартуМаршрута();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет форму бизнес-процесса
//
&НаСервере
Процедура ОбновитьКартуМаршрута()
	
	КартаМаршрута = РеквизитФормыВЗначение("Объект").ПолучитьКартуМаршрута();
	
КонецПроцедуры

#КонецОбласти
