#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расчитать(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Ответ =  ВопросАсинх("Перед расчетом документ будет записан. Продолжить?",
								  РежимДиалогаВопрос.ОКОтмена,
								  0,,
								  "Автоматический расчет ЗП");
								  
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	
	Записать();
	КонецЕсли;
	
	РасчитатьНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Расчитывает ЗП в таб часть
//
&НаСервере
Процедура РасчитатьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Рассчитать();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
